export const PlotFiltersMock = [
    {
        header: "Район",
        item: ['Голосеево', 'Оболонь', 'Троещина']
    },
    {
        header: "Цена за сотку",
        item: ['100', '200', '300']
    },
    {
        header: "Квадратура",
        item: ['50м²', '75м²', '100м²']
    },
    {
        header: "Тип земли",
        item: ['Жилая', 'Общественная', 'Историко-Культурная']
    }
];

export const PlotMockApi =
    [
        {
            id: 4357,
            name: "Участок 5,2 сот. (СНТ, ДНП)",
            category: 'plots',
            totalArea: 5.2,
            price: 4000000,
            location: "Краснодарский край, г.о. Сочи, с. Вардане-Верино, садоводческое товарищество Экспресс р-н Адлерский",
            size: "5.2 сот",
            photoSmallPath: require('../../../assets/plots_mock/plot_1.png'),
            photoLargePath: [
                { url: require('../../../assets/plots_mock/plot_1.png') },
                { url: require('../../../assets/plots_mock/plot_2.png') },
            ],
            favoriteNumber: 105,
            viewNumber: 212,
            percentageText: 'Процент на ипотеку',
            description: 'Продам участок 4.5 сот. по документам по факту 7 соток, подъезд асфальтированная дорога, электричество и газ на границе с участком, участок находится на берегу реки, живописные виды на горы, реку, хорошие соседи, до моря 600 метров)  до центра Сочи и Олимпийской деревне можно быстро доехать на ласточке без пробок ! до ЖД станции ЛОО 500 метров, посёлок очень быстро развивается! так же поможем с получением разрешительной документации и строительством (при необходимости)',
            objectDetails: [
                {
                    title: 'Тип земли:',
                    value: 'ИЖС'
                },
                {
                    title: 'Площадь участка:',
                    value: '7.5 соток',
                },
                {
                    title: 'Расстояние до моря:',
                    value: '240 м'
                },
                {
                    title: 'Тип сделки:',
                    value: '-'
                },
            ],
            agentId: 1,
            coords: [{
                lat: 654654,
                lon: 856156,
            }],
            inFavorite: false
        },
        {
            id: 4357469,
            name: "Участок 7 сот. (ИЖС)",
            category: 'plots',
            totalArea: 7,
            price: 4800000,
            location: "Краснодарский край, г.о. Сочи, с. Беранда, Араратская ул., 41 р-н Лазаревский",
            size: "7 соток",
            photoSmallPath: require('../../../assets/plots_mock/plot_2.png'),
            photoLargePath: [
                { url: require('../../../assets/plots_mock/plot_2.png') },
                { url: require('../../../assets/plots_mock/plot_1.png') },
            ],
            favoriteNumber: 10,
            viewNumber: 2620,
            percentageText: 'Процент на ипотеку',
            description: 'Продам участок 4.5 сот. по документам по факту 7 соток, подъезд асфальтированная дорога, электричество и газ на границе с участком, участок находится на берегу реки, живописные виды на горы, реку, хорошие соседи, до моря 600 метров)  до центра Сочи и Олимпийской деревне можно быстро доехать на ласточке без пробок ! до ЖД станции ЛОО 500 метров, посёлок очень быстро развивается! так же поможем с получением разрешительной документации и строительством (при необходимости)',
            objectDetails: [
                {
                    title: 'Тип земли:',
                    value: 'ИЖС'
                },
                {
                    title: 'Площадь участка:',
                    value: '7 соток',
                },
                {
                    title: 'Расстояние до моря:',
                    value: '240 м'
                },
                {
                    title: 'Тип сделки:',
                    value: '-'
                },
            ],
            agentId: 1,
            coords: [{
                lat: 654654,
                lon: 856156,
            }],
            inFavorite: true
        }, {
            id: 577876,
            name: "Участок 4,5 сот. (ИЖС).",
            category: 'plots',
            totalArea: 4.5,
            price: 7000000,
            location: "Краснодарский край, Сочи, посёлок Лоо, Жигулевская ул. р-н Лазаревский",
            size: "4,5 соток",
            photoSmallPath: require('../../../assets/plots_mock/plot_3.png'),
            photoLargePath: [
                { url: require('../../../assets/plots_mock/plot_3.png') },
                { url: require('../../../assets/plots_mock/plot_1.png') },
            ],
            favoriteNumber: 5,
            viewNumber: 2650,
            percentageText: 'Процент на ипотеку',
            description: 'Продам участок 7.5 сот. по документам по факту 7 соток, подъезд асфальтированная дорога, электричество и газ на границе с участком, участок находится на берегу реки, живописные виды на горы, реку, хорошие соседи, до моря 600 метров)  до центра Сочи и Олимпийской деревне можно быстро доехать на ласточке без пробок ! до ЖД станции ЛОО 500 метров, посёлок очень быстро развивается! так же поможем с получением разрешительной документации и строительством (при необходимости)',
            objectDetails: [
                {
                    title: 'Тип земли:',
                    value: 'ИЖС'
                },
                {
                    title: 'Площадь участка:',
                    value: '7.5 соток',
                },
                {
                    title: 'Расстояние до моря:',
                    value: '240 м'
                },
                {
                    title: 'Тип сделки:',
                    value: '-'
                },
            ],
            agentId: 4,
            coords: [{
                lat: 654654,
                lon: 856156,
            }],
            inFavorite: true
        }, {
            id: 435776786,
            name: "Участок 4,5 сот. (ИЖС)",
            category: 'plots',
            totalArea: 4.5,
            price: 7000000,
            location: "Краснодарский край, Сочи, микрорайон Новый Сочи, пер. Рахманинова р-н Центральный",
            size: "1 комната · 75 м²",
            photoSmallPath: require('../../../assets/plots_mock/plot_4.png'),
            photoLargePath: [
                { url: require('../../../assets/plots_mock/plot_4.png') },
                { url: require('../../../assets/plots_mock/plot_1.png') },
            ],
            favoriteNumber: 10,
            viewNumber: 260,
            percentageText: 'Процент на ипотеку',
            description: 'Продам участок 4.5 сот. по документам по факту 7 соток, подъезд асфальтированная дорога, электричество и газ на границе с участком, участок находится на берегу реки, живописные виды на горы, реку, хорошие соседи, до моря 600 метров)  до центра Сочи и Олимпийской деревне можно быстро доехать на ласточке без пробок ! до ЖД станции ЛОО 500 метров, посёлок очень быстро развивается! так же поможем с получением разрешительной документации и строительством (при необходимости)',
            objectDetails: [
                {
                    title: 'Тип земли:',
                    value: 'ИЖС'
                },
                {
                    title: 'Площадь участка:',
                    value: '7.5 соток',
                },
                {
                    title: 'Расстояние до моря:',
                    value: '240 м'
                },
                {
                    title: 'Тип сделки:',
                    value: '-'
                },
            ],
            agentId: 1,
            coords: [{
                lat: 654654,
                lon: 856156,
            }],
            inFavorite: false
        }, {
            id: 4357768869,
            name: "Участок 5,2 сот. (СНТ, ДНП)",
            category: 'plots',
            totalArea: 5.2,
            price: 27699000,
            oldPrice: 27700000,
            location: "Краснодарский край, Сочи, микрорайон Новый Сочи, пер. Рахманинова р-н Центральный",
            size: "5,2 сот.",
            photoSmallPath: require('../../../assets/plots_mock/plot_5.png'),
            photoLargePath: [
                { url: require('../../../assets/plots_mock/plot_5.png') },
                { url: require('../../../assets/plots_mock/plot_1.png') },
            ],
            favoriteNumber: 10,
            viewNumber: 260,
            percentageText: 'Процент на ипотеку',
            description: 'Продам участок 5,2 сот. по документам по факту 7 соток, подъезд асфальтированная дорога, электричество и газ на границе с участком, участок находится на берегу реки, живописные виды на горы, реку, хорошие соседи, до моря 600 метров)  до центра Сочи и Олимпийской деревне можно быстро доехать на ласточке без пробок ! до ЖД станции ЛОО 500 метров, посёлок очень быстро развивается! так же поможем с получением разрешительной документации и строительством (при необходимости)',
            objectDetails: [
                {
                    title: 'Тип земли:',
                    value: 'ИЖС'
                },
                {
                    title: 'Площадь участка:',
                    value: '7.5 соток',
                },
                {
                    title: 'Расстояние до моря:',
                    value: '240 м'
                },
                {
                    title: 'Тип сделки:',
                    value: '-'
                },
            ],
            agentId: 1,
            coords: [{
                lat: 654654,
                lon: 856156,
            }],
            inFavorite: true
        }, {
            id: 38823,
            name: "Участок 7 сот. (ИЖС)",
            category: 'plots',
            totalArea: 7,
            price: 4800000,
            location: "Краснодарский край, г.о. Сочи, с. Беранда, Араратская ул., 41 р-н Лазаревский",
            size: "1 комната · 75 м²",
            photoSmallPath: require('../../../assets/plots_mock/plot_6.png'),
            photoLargePath: [
                { url: require('../../../assets/plots_mock/plot_6.png') },
                { url: require('../../../assets/plots_mock/plot_4.png') },
            ],
            favoriteNumber: 10,
            viewNumber: 260,
            percentageText: 'Процент на ипотеку',
            description: 'Продам участок 4.5 сот. по документам по факту 7 соток, подъезд асфальтированная дорога, электричество и газ на границе с участком, участок находится на берегу реки, живописные виды на горы, реку, хорошие соседи, до моря 600 метров)  до центра Сочи и Олимпийской деревне можно быстро доехать на ласточке без пробок ! до ЖД станции ЛОО 500 метров, посёлок очень быстро развивается! так же поможем с получением разрешительной документации и строительством (при необходимости)',
            objectDetails: [
                {
                    title: 'Тип земли:',
                    value: 'ИЖС'
                },
                {
                    title: 'Площадь участка:',
                    value: '7.5 соток',
                },
                {
                    title: 'Расстояние до моря:',
                    value: '240 м'
                },
                {
                    title: 'Тип сделки:',
                    value: '-'
                },
            ],
            agentId: 1,
            coords: [{
                lat: 654654,
                lon: 856156,
            }],
            inFavorite: false
        },
    ]





